#### SetLayerModifiers Method

---

|  |
| --- |
| ExportLayerInfo Class   See Also |

Sets a project layer modifier array to the layer info.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void SetLayerModifiers( 	IList<LayerModifier> layermodifiers ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetLayerModifiers ( _ 	layermodifiers As IList(Of LayerModifier) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetLayerModifiers( 	IList<LayerModifier^>^ layermodifiers ) ``` |

#### Parameters

layermodifiers
:   Type:  System.Collections.Generic IList   LayerModifier
     The project layer modifier array.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLayerInfo Class

Autodesk.Revit.DB Namespace